Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.OverrideResult(System.Int32)
Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
result:  The result code you wish the Revit dialog to return.
Remarks:
The range of valid result values depends on the type of dialog as follows:
DialogBox: Any non-zero value will cause a dialog to be dismissed.
MessageBox: Standard Message Box IDs, such as IDOK and IDCANCEL, are accepted.
For all possible IDs, refer to the Windows API documentation.
The ID used must be relevant to the buttons in a message box.
TaskDialog: Standard Message Box IDs and Revit Custom IDs are accepted,
depending on the buttons used in a dialog. Standard buttons, such as OK
and Cancel, have standard IDs described in Windows API documentation.
Buttons with custom text have custom IDs with incremental values
starting at 1001 for the left-most or top-most button in a task dialog.
Returns:  True if the result code was accepted.

Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.HelpId
An ID that represents the dialog that has been displayed.
Remarks:  Use this ID within your application to key suitable responses for the dialog. Note: this id is
not guaranteed to remain stable for different builds of Autodesk Revit.

Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
The base class for the event arguments used by the DialogBoxShowing event.
Remarks:
The actual type of the event arguments will be different depending upon the type of dialog shown.
When the application receives this object, a dialog is to be displayed in Revit that
requires user interaction. The OverrideResult function can be used to cause the dialog
to be dismissed and return a desired result code.